In [1]:
a=10
b=20
c=a+b
print(c)

30

**Step-1: Import Packages**

In [2]:
import pandas as pd # for dataframes
import numpy as np # For mathematical functions
import matplotlib.pyplot as plt # For Visualization like graphs
import seaborn as sns # For Visualization like graphs

**Step-2: Create a Dataframe using List**

In [3]:
names=['Ramesh','Suresh','Mahesh','Kamesh']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names)

        0
0  Ramesh
1  Suresh
2  Mahesh
3  Kamesh

In [4]:
# Changing index
names=['Ramesh','Suresh','Mahesh','Kamesh']
ids=['A','B','C','D']
pd.DataFrame(names,ids)

        0
A  Ramesh
B  Suresh
C  Mahesh
D  Kamesh

In [5]:
# Changing column name
names=['Ramesh','Suresh','Mahesh','Kamesh']
ids=['A','B','C','D']
col=['Name']
pd.DataFrame(names,ids,col)

     Name
A  Ramesh
B  Suresh
C  Mahesh
D  Kamesh

**Step-5: Data and Columns**

In [6]:
# Changing only column name without changing index
# In this case we need to mention column name directly in 'pd' as we skipped the index.
# Because the order of taking is...data,index,columns
names=['Ramesh','Suresh','Mahesh','Kamesh']
col1=['Student_Name']
pd.DataFrame(names,columns=col1)

  Student_Name
0       Ramesh
1       Suresh
2       Mahesh
3       Kamesh

In [7]:
# We can also write the above as below instead of defining seperately
names=['Ramesh','Suresh','Mahesh','Kamesh']
pd.DataFrame(names,columns=['Candidates'])

  Candidates
0     Ramesh
1     Suresh
2     Mahesh
3     Kamesh

**Step-6: Multiple Columns**

In [14]:
names=['Ramesh','Suresh','Mahesh','Kamesh']
age=[20,22,21,23]
cols=['Names','Age']
df=pd.DataFrame(zip(names,age),columns=cols)
df

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Mahesh   21
3  Kamesh   23

In [13]:
names=['Ramesh','Suresh','Mahesh','Kamesh']
age=[20,22,21,23]
df=pd.DataFrame(zip(names,age),columns=['Names','Age'])
df

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Mahesh   21
3  Kamesh   23

**Step-7:Adding a new column to already existing dataframe**

- In the above case first we have taken the data, then we created a dataframe.
- But in this case we need to add new data based on the requirement.

In [18]:
city=['Hyd','Chen','Bnlr','Mumb']
df['City']=city # This step is selection which updates the actual dataframe ('df' in our case)
df

    Names  Age  City  Marks
0  Ramesh   20   Hyd     82
1  Suresh   22  Chen     85
2  Mahesh   21  Bnlr     90
3  Kamesh   23  Mumb     88

In [19]:
# Adding one more column
marks=[82,85,90,88]
df['Marks']=marks
df

    Names  Age  City  Marks
0  Ramesh   20   Hyd     82
1  Suresh   22  Chen     85
2  Mahesh   21  Bnlr     90
3  Kamesh   23  Mumb     88

**Step-8: Updating the existing column values with new values**

In [12]:
df

    Names  Age  City  Marks
0  Ramesh   20   Hyd     82
1  Suresh   22  Chen     85
2  Mahesh   21  Bnlr     90
3  Kamesh   23  Mumb     88

In [18]:
# Here take the actual column name(whose values has to be updated), in brackets
df['Marks']=[91,93,94,95] 
df

    Names  Age  City  Marks
0  Ramesh   20   Hyd     91
1  Suresh   22  Chen     93
2  Mahesh   21  Bnlr     94
3  Kamesh   23  Mumb     95

**Step-9: Creating empty dataframe and then adding columns**

In [21]:
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [22]:
df1['Names']=['Ramesh','Suresh','Mahesh','Mallesh']
df1['Age']=[20,22,21,23]
df1['City']=['Klky','Vngr','ACPT','DND']
df1

     Names  Age  City
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

**Step-10: Creating dataframe using Dictionary**

In [8]:
dict={'Names':['Ramesh','Suresh','Mahesh','Mallesh'],
    'Age':[20,22,21,23],
    'City':['Klky','Vngr','ACPT','DND']}
dict

{'Names': ['Ramesh', 'Suresh', 'Mahesh', 'Mallesh'],
 'Age': [20, 22, 21, 23],
 'City': ['Klky', 'Vngr', 'ACPT', 'DND']}

In [9]:
df2=pd.DataFrame(dict)
df2

     Names  Age  City
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

In [30]:
dict={'Names':['Ramesh'],
    'Age':[20],
    'City':['Klky']}
df3=pd.DataFrame(dict)
df3

    Names  Age  City
0  Ramesh   20  Klky

In [31]:
# But this give error because of scalar(single) values given.
dict={'Names':'Ramesh',
    'Age':20,
    'City':'Klky'}
df4=pd.DataFrame(dict)
df4

ValueError: If using all scalar values, you must pass an index

In [4]:
# We can correct the error as below by providing index.
# index can be any value not only zero
dict={'Names':'Ramesh',
    'Age':20,
    'City':'Klky'}
df4=pd.DataFrame(dict,index=[0])
df4

    Names  Age  City
0  Ramesh   20  Klky

**Step-11: Saving DataFrame**
- We can save dataframes either in .csv form or .xlsx form

In [33]:
df.to_csv('data.csv')

In [34]:
df.to_excel('data.xlsx')

In [35]:
df.to_html('data.html')

**Step-12: Reading Dataframe**

In [5]:
# In order to read the data we have 
# filename.extension
# open (mobox-short.txt).read() --> we already did this
# open (dummy.txt,mode='w').write('hello') --> we already did this

# We have already files with names --> data.csv  and data.xlsx
# Let's read the csv file

pd.read_csv('data.csv')

   Unnamed: 0   Names  Age  City  Marks
0           0  Ramesh   20   Hyd     91
1           1  Suresh   22  Chen     93
2           2  Mahesh   21  Bnlr     94
3           3  Kamesh   23  Mumb     95

In [23]:
df # But in this original df the extra column is not there as above with 'unnamed:0'

    Names  Age  City  Marks
0  Ramesh   20   Hyd     82
1  Suresh   22  Chen     85
2  Mahesh   21  Bnlr     90
3  Kamesh   23  Mumb     88

In [25]:
# reading excel file
# here also new column 'unnamed:0' is created
pd.read_excel('data.xlsx')

   Unnamed: 0   Names  Age
0           0  Ramesh   20
1           1  Suresh   22
2           2  Mahesh   21
3           3  Kamesh   23

In [33]:
# so we need to avoid the new column
# Let's create a new  DF again

dict={'Names':['Ramesh','Suresh','Mahesh','Mallesh'],
    'Age':[20,22,21,23],
    'City':['Klky','Vngr','ACPT','DND']}
df5=pd.DataFrame(dict)
df5

     Names  Age  City
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

In [ ]:
# CSV
df5.to_csv --> to save df
pd.read_csv --> to read

# Excel
df5.to_excel --> to save df
pd.read_excel --> to read

In [28]:
# if we take index=False, then automatically new index is not created
df5.to_csv('data1.csv',index=False)

In [29]:
# For CSV
# Now lets read the above
# We can see the new column not created
pd.read_csv('data1.csv')

     Names  Age  City
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

In [30]:
# For Excel
# Lets do the same above two steps
df5.to_excel('data1.xlsx',index=False)
pd.read_excel('data1.xlsx')

     Names  Age  City
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

In [63]:
# Adding one more column 'marks' to the above df5

df5['marks']=[90,92,94,98]
df5

     Names  Age  City  marks
0   Ramesh   20  Klky     90
1   Suresh   22  Vngr     92
2   Mahesh   21  ACPT     94
3  Mallesh   23   DND     98

**Step-13: Dropping the column**

- labels
- axis
- index
- columns
- inplace

In [64]:
# If we want to drop an index(row) then we need to use index argument name
df5.drop(index=1)

     Names  Age  City  marks
0   Ramesh   20  Klky     90
2   Mahesh   21  ACPT     94
3  Mallesh   23   DND     98

In [65]:
# But after the above step if we check the original df
# We see all data
df5

     Names  Age  City  marks
0   Ramesh   20  Klky     90
1   Suresh   22  Vngr     92
2   Mahesh   21  ACPT     94
3  Mallesh   23   DND     98

In [66]:
# If we want to drop a column then we need to use column name
df5.drop(columns='marks')

     Names  Age  City
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

In [67]:
# But again after the above step if we check the original df
# We see all data
df5

     Names  Age  City  marks
0   Ramesh   20  Klky     90
1   Suresh   22  Vngr     92
2   Mahesh   21  ACPT     94
3  Mallesh   23   DND     98

In [68]:
# To drop multiple columns we need to give the column names in a list
df5.drop(columns=['marks','City'])

     Names  Age
0   Ramesh   20
1   Suresh   22
2   Mahesh   21
3  Mallesh   23

In [69]:
# But again after the above step if we check the original df
# We see all data
df5

     Names  Age  City  marks
0   Ramesh   20  Klky     90
1   Suresh   22  Vngr     92
2   Mahesh   21  ACPT     94
3  Mallesh   23   DND     98

In [ ]:
# Python won't understand the below 2 cases of no arguments
df5.drop('marks') # if argument is not given it will given label
df5.drop(1) # here 1 become label as argument is not given

# so to make python understand whether the given value/dats is whether a column or index, we need to use 'Axis'
# By default --> Axis=0 (represents index)
# Means if we dont mention any Axis values by default it will be taken as zero(0)
# Axis=0 indicates index(row)
# Axis=1 indicates columns

In [57]:
# this will error because there is values as 'marks' in index/rows
df5.drop('marks')

KeyError: "['marks'] not found in axis"

In [56]:
df5.drop('marks',axis=0) # still gives error as axis=0 indicates index

KeyError: "['marks'] not found in axis"

In [70]:
# So the correct code to drop the column is
df5.drop('marks',axis=1)

     Names  Age  City
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

In [71]:
df5

     Names  Age  City  marks
0   Ramesh   20  Klky     90
1   Suresh   22  Vngr     92
2   Mahesh   21  ACPT     94
3  Mallesh   23   DND     98

**IN-PLACE**

- When we perform any operation the result/output is not overwritting in the above cases
- Means the original data is still existing in the dataframe even after dropping the index or columns
- In oreder to correct this scenarion we need to use **inplace** argument
- By default **inplace=Fault**
- Make **inplace=True** if we want to delete data permanantly or overwrite the result

In [72]:
# As we are taking only one column, we can give it directly
# If multiple columbs has to be dropped then mention them in a list
df5.drop('marks',axis=1,inplace=True)
df5

     Names  Age  City
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

In [73]:
# Now we can see the marks column got deleted permanently
df5

     Names  Age  City
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

**Step-14: Renaming the column**

In [88]:
d={'City':'city'}  # old vs New
# df5.rename(<mapper>,<axis>,<inplace>)
df5.rename(d,axis=1,inplace=True)
df5

     Names  Age  city
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

In [89]:
# We can also write directly without defining separately
df5.rename({'city':'Sity'},axis=1,inplace=True)
df5

     Names  Age  Sity
0   Ramesh   20  Klky
1   Suresh   22  Vngr
2   Mahesh   21  ACPT
3  Mallesh   23   DND

In [90]:
# Renaming the index(row)
# df5.rename(<mapper>,<axis>,<inplace>)
df5.rename({2:'B'},axis=0,inplace=True)
df5

     Names  Age  Sity
0   Ramesh   20  Klky
1   Suresh   22  Vngr
B   Mahesh   21  ACPT
3  Mallesh   23   DND

In [94]:
# Creat a df with details
# x=1 to 10
# y=square of x
# z= cube of x

x=list(range(0,11))
y=[i*i for i in x]
z=[i**3 for i in x]
df6=pd.DataFrame(zip(x,y,z),columns=['X','Y','Z'])
df6

     X    Y     Z
0    0    0     0
1    1    1     1
2    2    4     8
3    3    9    27
4    4   16    64
5    5   25   125
6    6   36   216
7    7   49   343
8    8   64   512
9    9   81   729
10  10  100  1000

In [ ]:
# Important methods of DataFrame
- len: len(df)
- shape: df.shape
- size: df.size
- head: df.head
- tail: df.tail
- isnull: df.isnull
- dtypes: df.dtypes
- info: df.info

In [97]:
len(df6)

11

In [99]:
df6.shape # 11 rows, 3 columns

(11, 3)

In [100]:
df6.size

33

In [102]:
df6.head()

   X   Y   Z
0  0   0   0
1  1   1   1
2  2   4   8
3  3   9  27
4  4  16  64

In [103]:
df6.tail()

     X    Y     Z
6    6   36   216
7    7   49   343
8    8   64   512
9    9   81   729
10  10  100  1000

In [104]:
df6.isnull()

        X      Y      Z
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False
5   False  False  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False
10  False  False  False

In [109]:
df6.isnull().sum() # gives total null values (True count) for each column

X    0
Y    0
Z    0
dtype: int64

In [110]:
df6.dtypes
# if any categorical column exists it will be represented as object like
# for interger ==> int64 will be shown
# for float ==> float
# fro string ==> object will be shown

X    int64
Y    int64
Z    int64
dtype: object

In [108]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       11 non-null     int64
 1   Y       11 non-null     int64
 2   Z       11 non-null     int64
dtypes: int64(3)
memory usage: 396.0 bytes

**Step-15: Selecting columns**

In [111]:
# To select all columns
df5.columns

Index(['Names', 'Age', 'Sity'], dtype='object')

In [112]:
df6['X'] # selecting one particular column

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
Name: X, dtype: int64

In [114]:
# selecting multiple columns
# Give two square brackets for two columns as theya re 2 seperate lists
df6[['X','Y']]

     X    Y
0    0    0
1    1    1
2    2    4
3    3    9
4    4   16
5    5   25
6    6   36
7    7   49
8    8   64
9    9   81
10  10  100

In [ ]:
# In the above cases
# column name is not shown when we select one column
# But column name is shown when we select multiple columns
# It is called as a DataFrame when column names are indicated
# Single column will be never represented as DataFrame

In [115]:
type(df6['X']) # indicates series(No colun names) due to single column
# It is 1-Dimensional

pandas.core.series.Series

In [117]:
type(df6[['X','Y']]) # indicates DataFrame(with column Names) due to multiple columns
# It is 2-Dimensional

pandas.core.frame.DataFrame

In [119]:
df6['X'].shape   # 1-D

(11,)

In [120]:
df6[['X','Y']].shape   # 2-D

(11, 2)

In [122]:
# If we want to extract only a particular column data/values we use '.values' method
df6['Z'].values

array([   0,    1,    8,   27,   64,  125,  216,  343,  512,  729, 1000])

In [124]:
# To get the extracted values in a list
df6['Z'].values.tolist()

[0, 1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [125]:
# to extract two columns data
df6[['Y','Z']].values

array([[   0,    0],
       [   1,    1],
       [   4,    8],
       [   9,   27],
       [  16,   64],
       [  25,  125],
       [  36,  216],
       [  49,  343],
       [  64,  512],
       [  81,  729],
       [ 100, 1000]])

In [127]:
# Summary:
# df6 # to select dataframe
# df6['X']  # to select particular column
# df6['X'].values  # to extract particular column data
# df6['X'].values.tolist()  # to extract particular column data in a list